# 6.Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
#  https://drive.google.com/file/d/12fJPEO0ijZLsImTOq8CxS4EHqo-x5Ln5/view?usp=sharing
number = int(input('Введите номер буквы в алфавите: '))

char = chr(number + 96)

print(char)
